class Answers:

    """Этот класс хранит в себе все возможные ответы нашего приложения пользователю."""

    @staticmethod
    def about_skill():  # о навыке
        resp = {
            "response": {
                "text": "Правила и прочая фигня",
                "tts": "",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    @staticmethod  # Этот декоратор делает метод статическим, т.е. его можно вызывать без экземпляра класса.
    def hello():
        """Приветствие."""
        resp = {
            "response": {
                "text": "Приветствую! Это мой новый навык, который позволит вам окунуться "
                        "в мир невероятных фэнтезийных приключений. Если захочешь продолжить, "
                        "скажи мне.",
                "tts":  "Приветствую! Это мой новый навык, который позволит вам окунуться "
                        "в мир невероятных фэнтезийных приключений. Если захочешь продолжить, "
                        "скажи мне.",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp  # отправляем ответ сервера

    @staticmethod
    def empty():
        """Пустой ответ."""
        resp = {
            "response": {
                "text": "",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    @staticmethod
    def not_heard():
        import random
        answ = ["Что-что? Я не услышал. Можешь повторить?", "Да? Извините, я задумался. Повторите, пожалуйста",
                "Не понял, что вы имели в виду. Может изъяснитесь как-то иначе?"]
        ans = random.choice(answ)
        resp = {
            "response": {
                "text": ans,
                "tts": ans,
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    @staticmethod
    def bye():
        resp = {
            "response": {
                "text": "До новых встреч!",
                "end_session": True
            },
            "version": "1.0"
        }
        return resp

    @staticmethod
    def intro():  # начало повествования
        resp = {
            "response": {
                "text": "Холодный январь, ветер и снег. По просёлочной дороге, устало склонив голову, идёт закутанная в "
                        "темный плащ фигура странника с мечом на поясе и легкой сумкой за спиной - вы. Который день "
                        "перебирая ноги, полностью погрузившись в свои мысли, она движется в единственном направлении. "
                        "Напрямую в город, именуемый Летрен. Однако, прямо сейчас, когда вьюга неугомонно силится, "
                        "а ноги через раз следуют командам мозга, будет лучше спрятаться и отдохнуть - подсказывают "
                        "вам опыт да и банальный здравый смысл.\n\n"
                        "Итак, что же вы сделаете: сойдёте с дороги или же продолжите путь?",
                "tts": "Холодный январь, ветер и снег. По просёлочной дороге, устало склонив голову, идёт закутанная в "
                        "темный плащ фигура странника с мечом на поясе и легкой сумкой за спиной - вы. Который день "
                        "перебирая ноги, полностью погрузившись в свои мысли, она движется в единственном направлении. "
                        "Напрямую в город, именуемый Л+етрен. Однако, прямо сейчас, когда вьюга неугомонно силится, "
                        "а ноги через раз следуют командам мозга, будет лучше спрятаться и отдохнуть - подсказывают "
                        "вам опыт да и банальный здравый смысл.\n\n"
                        "Итак, что же вы сделаете: сойдёте с дороги или же продолжите путь?",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    #
    # ПЕРВЫЙ СЮЖ. ВЫБ.
    #
    @staticmethod
    def roadside_change():  # отходим от дороги (первый сюж. выбор)
        resp = {
            "response": {
                "text": "Приняв сторону здравого смысла, вы неспеша отходите в сторону и аккуратно спускаетесь в кювет, " 
                        "усаживаетесь меж корней толстого дуба и наконец можете спокойно вздохнуть. Да - здесь куда менее холодно, "
                        "чем на открытой дороге, хоть ветер и воет так, что неслышно собственных мыслей. Вам хочется есть, но вы знаете, "
                        "что в вашей сумке еды нет. Вам хочется спать, но спать в такой холод - опасно. Как удачно, что за спиной, в "
                        "багаже, у вас должно быть всё необходимое.\n\n"
                        "Теперь вы можете либо открыть сумку, либо не предпринимать никаких действий.",
                "tts": "Приняв сторону здравого смысла, вы неспеша отходите в сторону и аккуратно спускаетесь в кювет, " 
                        "усаживаетесь меж корней толстого дуба и наконец можете спокойно вздохнуть. Да - здесь куда менее холодно, "
                        "чем на открытой дороге, хоть ветер и воет так, что неслышно собственных мыслей. Вам хочется есть, но вы знаете, "
                        "что в вашей сумке еды нет. Вам хочется спать, но спать в такой холод - опасно. Как удачно, что за спиной, в "
                        "багаже, у вас должно быть всё необходимое.\n\n"
                        "Теперь вы можете либо открыть сумку, либо не предпринимать никаких действий.",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp
    
    @staticmethod
    def deathroad_change():  # остаёмся на дороге (первый сюж.выбор)
        import random
        ans = ["Хм-м-м, честно сказать, я ожидал от вас чего-то большего. Может повезёт в следующий раз? Скажите мне, если "
               "хотите повторить попытку.", "Да уж. Не самая лучшая партия... Быть может, вы хотите попробовать ещё раз? Скажите мне, "
               "если захотите начать новую игру.", "Не думал, что всё может кончиться вот так. Думаю, вам следует попробовать снова. "
               "Скажите мне, если захотите попробовать ещё раз."]
        completion = random.choice(ans)
        resp = {
            "response": {
                "text": "Решив остаться на дороге, в какой-то момент, вы понимаете, это - конец. Ноги не послушают уже никаких ваших " 
                        "команд, да и сил на простой поворот - даже тех не осталось. Вы спотыкаетесь, и обжигающе холодный снег терпит удар вашего "
                        "лица, пока белая пелена застилает взор раз и навсегда...\n\n\n\n"+completion,
                "tts": "Решив остаться на дороге, в какой-то момент, вы понимаете, это - конец. Ноги не послушают уже никаких ваших " 
                        "команд, да и сил на простой поворот - даже тех не осталось. Вы спотыкаетесь, и обжигающе холодный снег терпит удар вашего "
                        "лица, пока белая пелена застилает взор раз и навсегда...\n\n\n\n"+completion,
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    #
    # ВТОРОЙ СЮЖ. ВЫБ.
    #
    @staticmethod
    def open_bag_change():  # открываем мешок (третий сюж. выб.)
        resp = {
            "response": {
                "text": "Вы снимаете с плеча мешок, кладёте тот перед собой и заглядывайте внутрь. Внутри - всего навсего небольшой "
                        "кошель с горсткой монет, пара сухих брёвен, кусочек угля, да ткань, обрывок какого-то дорогого и наверняка "
                        "тёплого плаща, найденный вами на дороге не так давно. Вот и все ваши пожитки, к сожалению. А руки, тем временем, "
                        "мёрзнут.\n\n"
                        "Сейчас вы можете сделать следующее: разжечь костёр, обернуть руки тканью или же ничего не делать.",
                "tts": "Вы снимаете с плеча мешок, кладёте тот перед собой и заглядывайте внутрь. Внутри - всего навсего небольшой "
                        "кошель с горсткой монет, пара сухих брёвен, кусочек угля, да ткань, обрывок какого-то дорогого и наверняка "
                        "тёплого плаща, найденный вами на дороге не так давно. Вот и все ваши пожитки, к сожалению. А руки, тем временем, "
                        "мёрзнут.\n\n"
                        "Сейчас вы можете сделать следующее: разжечь костёр, обернуть руки тканью или же ничего не делать.",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    #
    # ТРЕТИЙ СЮЖ. ВЫБ.
    #
    @staticmethod
    def roadside_death():  # смерть (второй и третий сюж. выборы)
        import random
        ans = ["Хм-м-м, честно сказать, я ожидал от вас чего-то большего. Может повезёт в следующий раз? Скажите мне, если "
               "хотите повторить попытку.", "Да уж. Не самая лучшая партия... Быть может, вы хотите попробовать ещё раз? Скажите мне, "
               "если захотите начать новую игру.", "Не думал, что всё может кончиться вот так. Думаю, вам следует попробовать снова. "
               "Скажите мне, если захотите попробовать ещё раз."]
        completion = random.choice(ans)
        resp = {
            "response": {
                "text": "Впрочем, к чему это беспокойство? Как может навредить вашему могучему и закалённому странствиями телу "
                        "какая-то замёрзшая вода. Бездействие - тоже действие. И вскоре, белая пелена раз и навсегда застилает "
                        "ваш, уже ни на чём не сфокусированный, взор...\n\n\n\n"+completion,
                "tts": "Впрочем, к чему это беспокойство? Как может навредить вашему могучему и закалённому странствиями телу "
                        "какая-то замёрзшая вода. Бездействие - тоже действие. И вскоре, белая пелена раз и навсегда застилает "
                        "ваш, уже ни на чём не сфокусированный, взор...\n\n\n\n"+completion,
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    @staticmethod
    def make_fire():  # разжигаем костёр (третий сюж. выб.)
        resp = {
            "response": {
                "text": "Скоро, в вашу голову приходит светлая мысль - зажечь огонь. Вы расчищаете от снега небольшое углубление перед "
                        "своими ногами, кладёте туда брёвнышки, взятые из мешка, в центр кладёте кусочек угла, который достали оттуда же, "
                        "и щелчком пальцев зажигаете яркое алое пламя. Тёплое и приятное, так и клонящее вас в ,спасительный от этой грохочущей вьюги, сон."
                        "Скажите, если хотите продолжить.",
                "tts": "Скоро, в вашу голову приходит светлая мысль - зажечь огонь. Вы расчищаете от снега небольшое углубление перед "
                        "своими ногами, кладёте туда брёвнышки, взятые из мешка, в центр кладёте кусочек угла, который достали оттуда же, "
                        "и щелчком пальцев зажигаете яркое алое пламя. Тёплое и приятное, так и клонящее вас в ,спасительный от этой грохочущей вьюги, сон."
                        "Скажите, если хотите продолжить.",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    @staticmethod
    def wrap_hands():
        resp = {
            "response": {
                "text": "Вы решаете взять в руки кусок плаща. Тёплый и мягкий, он вскоре заставляет вас снова почувствовать "
                        "собственные пальцы. Этот факт радует, а приятный на ощупь обрывок качественной шкуры так и клонит в, "
                        "спасительный от этой грохочущей вьюги, сон."
                        "Скажите, если хотите продолжить.",
                "tts": "Вы решаете взять в руки кусок плаща. Тёплый и мягкий, он вскоре заставляет вас снова почувствовать "
                        "собственные пальцы. Этот факт радует, а приятный на ощупь обрывок качественной шкуры так и клонит в, "
                        "спасительный от этой грохочущей вьюги, сон."
                        "Скажите, если хотите продолжить.",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    #
    # БАНДИТЫ. ВСТУПЛЕНИЕ
    #
    @staticmethod
    def wake_up():
        resp = {
            "response": {
                "text": "ГЛАВА ВТОРАЯ\nХолодный приём.\n\n\nПробуждение: 'Утро героя началось с крика', бандиты обыскивающие вещи игрока",
                "tts": "",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    @staticmethod
    def fight():
        resp = {
            "response": {
                "text": "Вы поднимаетесь на ноги и достаёте из-за пояса меч, бандиты удивляются и достают из-за спины железные "
                        "кинжалы - начинается потасовка.",
                "tts": "Вы поднимаетесь н+а ноги и достаёте из-за пояса меч, бандиты удивляются и достают из-за спины железные "
                        "кинжалы - начинается потас+овка.",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    @staticmethod
    def fight_status():

        resp = {
            "response": {
                "text": "",
                "tts": "",
                "end_session": False
            },
            "version": "1.0"
        }

    @staticmethod
    def do_nothing():
        resp = {
            "response": {
                "text": "Бездействие: герой притворяется мёртвым, бандиты забирают практически все его вещи , "
                        "деньги и уходят",
                "tts": "",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp
