class Answers:

    """Этот класс хранит в себе все возможные ответы нашего приложения пользователю."""

    @staticmethod  # Этот декоратор делает метод статическим, т.е. его можно вызывать без экземпляра класса.
    def hello():
        """Приветствие."""
        resp = {
            "response": {
                "text": "Приветствую! Это мой новый навык, который позволит вам окунуться "
                        "в мир невероятных фэнтезийных приключений. Если захочешь продолжить, "
                        "скажи мне.",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp  # отправляем ответ сервера

    @staticmethod
    def empty():
        """Пустой ответ."""
        resp = {
            "response": {
                "text": "",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    # @staticmethod
    # def new_player():
        # resp = {
            # "response": {
                # "text": "Я вижу, ты у нас новенький. Верно? Чтож, тогда тебе объяснить правила?",
                # "buttons": [
                    # {
                        # "title": "Мне не нужна помощь!",
                        # "hide": True
                    # },
                    # {
                        # "title": "Выкладывай!",
                        # "hide": True
                    # }
                            # ],
                # "end_session": False
            # },
            # "version": "1.0"
        # }
        # return resp
    @staticmethod
    def intro():
        resp = {
            "response": {
                "text": "Холодный январь, ветер и снег. По просёлочной дороге, устало склонив голову, идёт закутанная в "
                        "темный плащ фигура странника с мечом на поясе и легкой сумкой за спиной - вы. Который день "
                        "перебирая ноги, полностью погрузившись в свои мысли, она движется в единственном направлении. "
                        "Напрямую в город, именуемый Летрен. Однако, прямо сейчас, когда вьюга неугомонно силится, "
                        "а ноги через раз следуют командам мозга, будет лучше спрятаться и отдохнуть - подсказывают "
                        "вам опыт да и банальный здравый смысл.\n\n"
                        "Итак, что же вы сделаете: сойдёте с дороги или же продолжите путь?",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    @staticmethod
    def new_game():
        resp = {
            "response": {
                "text": "Ааа! Новая игра. С чистого листа. Ну, чтож, продолжим!",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    @staticmethod
    def not_heard():
        resp = {
            "response": {
                "text": "Что-что? Я не услышал. Можешь повторить?",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp

    @staticmethod
    def bye():
        resp = {
            "response": {
                "text": "До новых встреч!",
                "end_session": True
            },
            "version": "1.0"
        }
        return resp
    
    @staticmethod
    def roadside_change():
        resp = {
            "response": {
                "text": "Приняв сторону здравого смысла, вы неспеша отходите в сторону и аккуратно спускаетесь в кювет, " 
                        "усаживаетесь меж корней толстого дуба и наконец можете спокойно вздохнуть. Да - здесь куда менее холодно, "
                        "чем на открытой дороге, хоть ветер и воет так, что неслышно собственных мыслей. Вам хочется есть, но вы знаете, "
                        "что в вашей сумке еды нет. Вам хочется спать, но спать в такой холод - опасно. Как удачно, что за спиной, в "
                        "багаже, у вас должно быть всё необходимое.\n\n"
                        "Теперь вы можете либо открыть сумку, либо не предпринимать никаких действий.",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp
    
    @staticmethod
    def deathroad_change():
        import random
        ans = ["Хм-м-м, честно сказать, я ожидал от вас чего-то большего. Может повезёт в следующий раз? Скажите мне, если "
               "хотите повторить попытку.", "Да уж. Не самая лучшая партия... Быть может, вы хотите попробовать ещё раз? Скажите мне, "
               "если захотите начать новую игру.", "Не думал, что всё может кончиться вот так. Думаю, вам следует попробовать снова. "
               "Скажите мне, если захотите попробовать ещё раз."]
        resp = {
            "response": {
                "text": "Решив остаться на дороге, в какой-то момент, вы понимаете, это - конец. Ноги не послушают уже никаких ваших " 
                        "команд, да и сил на простой поворот - даже тех не осталось. Вы спотыкаетесь, и обжигающе холодный снег терпит удар вашего "
                        "лица, пока белая пелена застилает взор раз и навсегда...\n\n\n\n"+random.choice(ans),
                "end_session": False
            },
            "version": "1.0"
        }
        return resp
    
    @staticmethod
    def about_skill():
        resp = {
            "response": {
                "text": "Правила и прочая фигня",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp
    
    @staticmethod
    def roadside_death():
        import random
        ans = ["Хм-м-м, честно сказать, я ожидал от вас чего-то большего. Может повезёт в следующий раз? Скажите мне, если "
               "хотите повторить попытку.", "Да уж. Не самая лучшая партия... Быть может, вы хотите попробовать ещё раз? Скажите мне, "
               "если захотите начать новую игру.", "Не думал, что всё может кончиться вот так. Думаю, вам следует попробовать снова. "
               "Скажите мне, если захотите попробовать ещё раз."]
        resp = {
            "response": {
                "text": "Впрочем, к чему это беспокойство? Как может навредить вашему могучему и закалённому странствиями телу "
                        "какая-то замёрзшая вода. Бездействие - тоже действие. И вскоре, белая пелена раз и навсегда застилает "
                        "ваш, уже ни на чём не сфокусированный, взор...\n\n\n\n"+random.choice(ans),
                "end_session": False
            },
            "version": "1.0"
        }
        return resp
        
    @staticmethod
    def open_bag_change():
        resp = {
            "response": {
                "text": "Вы снимаете с плеча мешок, кладёте тот перед собой и заглядывайте внутрь. Внутри - всего навсего небольшой "
                        "кошель с горсткой монет, пара сухих брёвен, кусочек угля, да ткань, обрывок какого-то дорогого и наверняка "
                        "тёплого плаща, найденный вами на дороге не так давно. Вот и все ваши пожитки, к сожалению. А руки, тем временем, " 
                        "мёрзнут.\n\n"
                        "Сейчас вы можете сделать следующее: разжечь костёр, обернуть руки тканью или же ничего не делать.",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp
    
    @staticmethod
    def make_fire():
        resp = {
            "response": {
                "text": "Скоро, в вашу голову приходит светлая мысль - зажечь огонь. Вы расчищаете от снега небольшое углубление перед "
                        "своими ногами, кладёте туда брёвнышки, взятые из мешка, в центр кладёте кусочек угла, который достали оттуда же, "
                        "и щелчком пальцев зажигаете яркое алое пламя. Тёплое и приятное, так и клонящее вас в ,спасительный от этой грохочущей вьюги, сон.",
                "end_session": False
            },
            "version": "1.0"
        }
        return resp
            