class Intents:
    que_ans = {
        "о навыке": ["для чего ты", "кто ты", "что умеешь", "о навыке"],
        "помощь": ["помоги", "я не знаю, что делать", "помощь", "помоги мне"],
        "новая игра": ["давай по новой", "начни новую игру", "давай начнём снова", "переиграем", "давай сначала", "новая игра"],
        "продолжить": ["продолжай", "я готов", "давай дальше", "в полной готовности", "давай к делу"],
        "продолжить (повествование)": ["продолжай", "я готов", "давай дальше"],
        "выход": ["завязывай", "вырубай", "завершай", "выходи", "выход", "завершить"],
        "битва": {
            "атака мечом": ["атака мечом", "меч"],
            "атака магией": ["атака магией", "магия"],
            "уклонение": ["уклониться", "увернуться", "мансить"],
            "лечение": ["лечение", "хил", "излечиться", "аптечка"],           
            "№противника": {           
                1: ["первый", "один"],
                2: ["второй", "два"],
                3: ["третий", "три"],
                4: ["четыре", "четвертый"]
            }
            
        }
        "первый выбор": {
            "первый": ["cвернуть к обочине", "cвернуть", "повернуть к обочине", "повернуть", "к обочине", "cвернуть в кювет",
                       "повернуть в кювет", "в кювет", "первый вариант", "первый", "давай первый вариант", "сходи с дороги", 
                       "сойти с дороги", "сойти на обочину", "зайти на обочину", "зайти в кювет", "свернуть", "давай первый"],
            "второй": ["остаться на дороге", "остаться", "ничего не делать", "бездействовать", "бездействие", "идти дальше",
                       "продолжать идти", "второй вариант", "второй", "давай второй вариант", "давай второй", "давай второй",
                       "продолжить путь", "продолжать", "продолжить"]
        },
        "второй выбор": {
            "первый": ["раскрыть сумку", "сумка", "взять сумку", "использовать сумку", "заглянуть в сумку", "посмотреть сумку",
                       "пошариться в сумке", "обыскать сумку", "достать сумку", "осмотреть сумку", "посмотреть содержимое сумки",
                       "осмотреть содержимое сумки", "осмотреть вещи в сумке", "посмотреть на вещи в сумке", "первый", 
                       "давай первый вариант", "давай первый", "открыть сумку", "первый вариант"],
            "второй": ["ничего не делать", "бездействие", "продолжать сидеть", "сидеть дальше", "второй", "давай второй вариант", 
                       "второй вариант", "давай второй"]
        },
        
        "третий выбор": {
            "первый": ["разжечь костер", "костер", "зажечь костер", "сделать костер", "согреться костром", "первый вариант", 
                       "первый", "давай первый вариант", "давай первый"],
            "второй": ["обернуть руки тканью", "обернуть руки", "ткань", "второй", "давай второй вариант", "второй вариант", "давай второй"],
            "третий": ["ничего не делать", "бездействие", "продолжать сидеть", "сидеть дальше", "третий", "давай третий вариант", 
                       "третий вариант", "давай третий"]
        },
        "четвёртый выбор": {
            "первый": ["драка", "намять негодяям бока", "драться", "сражаться"],
            "второй": ["ничего не делать", "бездействие", "продолжать лежать", "лежать дальше", "второй", "давай второй вариант", 
                       "второй вариант", "давай второй", "лежать", "притвориться мертвым"]
        }
        
        
    }

    changes = {1:1, 2:2, 3: 2, 4: 4, 5: 2, 6: 4, 7: 2, 8: 8, 9: 8, 12: 11, 14: 13, 16: 15, 18: 17, 19: 17}  # Это список стадий сюжетных выборов. Он нужен для адекватного продолжения игры при след. запуске.
    items = {
        "money": 0,
        "healing_posion": 1,
        "rope": 2,
        "stable_key": 3,
        "room_key": 4
    }