class Intents:
    que_ans = {
        "о навыке": ["для чего ты", "кто ты", "что умеешь", "что", "о навыке"],
        "новая игра": ["давай по новой", "начни новую игру", "давай начнём снова", "переиграем", "давай сначала", "новая игра",
                       "снова", "давай снова"],
        "продолжить": ["продолжай", "я готов", "давай дальше", "в полной готовности", "давай к делу"],
        "продолжить (повествование)": ["продолжай", "продолжить", "дальше", "ага"],
        "выход": ["завязывай", "вырубай", "завершай", "выходи", "выход", "завершить"],
        "первый выбор": {
            "первый": ["cвернуть к обочине", "cвернуть", "повернуть к обочине", "повернуть", "к обочине", "cвернуть в кювет",
                       "повернуть в кювет", "в кювет", "первый вариант", "первый", "давай первый вариант", "сходи с дороги", 
                       "сойти с дороги", "сойти на обочину", "зайти на обочину", "зайти в кювет", "свернуть", "давай первый"],
            "второй": ["остаться на дороге", "остаться", "ничего не делать", "бездействовать", "бездействие", "идти дальше",
                       "продолжать идти", "второй вариант", "второй", "давай второй вариант", "давай второй", "давай второй",
                       "продолжить путь", "продолжать", "продолжить"]
        },
        "второй выбор": {
            "первый": ["раскрыть сумку", "сумка", "взять сумку", "использовать сумку", "заглянуть в сумку", "посмотреть сумку",
                       "пошариться в сумке", "обыскать сумку", "достать сумку", "осмотреть сумку", "посмотреть содержимое сумки",
                       "осмотреть содержимое сумки", "осмотреть вещи в сумке", "посмотреть на вещи в сумке", "первый", 
                       "давай первый вариант", "давай первый", "открыть сумку", "первый вариант"],
            "второй": ["ничего не делать", "бездействие", "продолжать сидеть", "сидеть дальше", "второй", "давай второй вариант", 
                       "второй вариант", "давай второй"]
        },
        
        "третий выбор": {
            "первый": ["разжечь костер", "костер", "зажечь костер", "сделать костер", "согреться костром", "первый вариант", 
                       "первый", "давай первый вариант", "давай первый"],
            "второй": ["обернуть руки тканью", "обернуть руки", "ткань", "второй", "давай второй вариант", "второй вариант", "давай второй"],
            "третий": ["ничего не делать", "бездействие", "продолжать сидеть", "сидеть дальше", "третий", "давай третий вариант", 
                       "третий вариант", "давай третий"]
        },
        "пробуждение": {
            "драка": ["навалять негодяям", "начать драку", "драться", "встать на ноги", "встать"],
            "бездействие": ["ничего не делать", "бездействие", "продолжать сидеть", "лежать дальше", "второй", "давай второй вариант",
                            "второй вариант", "давай второй"]
        }
    }

    changes = {1: 1, 2: 2, 3: 2, 4: 4, 5: 2, 6: 4, 7: 2, 8: 8, 9: 8, 12: 11, 14: 13, 16: 15}  # Это список стадий сюжетных выборов. Он нужен для адекватного продолжения игры при след. запуске.

    items = {
        "money": 0,
        "rope": 1,
        "healing posion": 2,
        "stable key": 3,
        "room key": 4
    }